/*Дана строка (сохранить в файл и читать из файла)
[{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},
{"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},
{"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
Написать метод(ы), который распарсит json и, используя StringBuilder, 
создаст строки вида: Студент [фамилия] получил [оценка] по предмету [предмет].
Пример вывода:
Студент Иванов получил 5 по предмету Математика.
Студент Петрова получил 4 по предмету Информатика.
Студент Краснов получил 5 по предмету Физика. */



public class Task_03 {

    String test="[{фамилия:Иванов,оценка:5,предмет:Математика},{фамилия:Петрова,оценка:4,предмет:Информатика},{фамилия:Краснов,оценка:5,предмет:Физика}]";

    public Task_03(){
        System.out.println(jsonParse(test));
    }

    /**
     * преобразование строки JSON файла в строку требуемого запроса
     * 
     * @param json строка JSON файла
     * @return строка для добавления к запросу
     */
    private String jsonParse(String json) {
        var sb = new StringBuilder("");
        // разбиваем на ячейки
        var items = json.split("[},{]");
        // перебираем полученные ячейки
        for (String subItem : items) {
            if(subItem.contains("фамилия")){
                sb.append("Студент "+subItem.split("[:]")[1]);
            }
            else if(subItem.contains("оценка")){
                sb.append(" получил "+subItem.split("[:]")[1]);
            }
            else if(subItem.contains("предмет")){
                sb.append(" по предмету "+subItem.split("[:]")[1]+"\n");
            }
        }
        return sb.toString();
    }
    
}
